day - 11/task - 1/k6-results.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: load-test.js
        output: -

     scenarios: (100.00%) 2 scenarios, 20 max VUs, 1m0s max duration (incl. graceful stop):
              * authors_slow: 10 looping VUs for 30s (exec: authorsSlow, gracefulStop: 30s)
              * quotes_baseline: 10 looping VUs for 30s (exec: quotesBaseline, gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 320 complete and 0 interrupted iterations
authors_slow      [   3% ] 10 VUs  01.0s/30s
quotes_baseline   [   3% ] 10 VUs  01.0s/30s

running (0m02.0s), 20/20 VUs, 1037 complete and 0 interrupted iterations
authors_slow      [   7% ] 10 VUs  02.0s/30s
quotes_baseline   [   7% ] 10 VUs  02.0s/30s

running (0m03.0s), 20/20 VUs, 1731 complete and 0 interrupted iterations
authors_slow      [  10% ] 10 VUs  03.0s/30s
quotes_baseline   [  10% ] 10 VUs  03.0s/30s

running (0m04.0s), 20/20 VUs, 2481 complete and 0 interrupted iterations
authors_slow      [  13% ] 10 VUs  04.0s/30s
quotes_baseline   [  13% ] 10 VUs  04.0s/30s

running (0m05.0s), 20/20 VUs, 3212 complete and 0 interrupted iterations
authors_slow      [  17% ] 10 VUs  05.0s/30s
quotes_baseline   [  17% ] 10 VUs  05.0s/30s

running (0m06.0s), 20/20 VUs, 3933 complete and 0 interrupted iterations
authors_slow      [  20% ] 10 VUs  06.0s/30s
quotes_baseline   [  20% ] 10 VUs  06.0s/30s

running (0m07.0s), 20/20 VUs, 4643 complete and 0 interrupted iterations
authors_slow      [  23% ] 10 VUs  07.0s/30s
quotes_baseline   [  23% ] 10 VUs  07.0s/30s

running (0m08.0s), 20/20 VUs, 5379 complete and 0 interrupted iterations
authors_slow      [  27% ] 10 VUs  08.0s/30s
quotes_baseline   [  27% ] 10 VUs  08.0s/30s

running (0m09.0s), 20/20 VUs, 5999 complete and 0 interrupted iterations
authors_slow      [  30% ] 10 VUs  09.0s/30s
quotes_baseline   [  30% ] 10 VUs  09.0s/30s

running (0m10.0s), 20/20 VUs, 6535 complete and 0 interrupted iterations
authors_slow      [  33% ] 10 VUs  10.0s/30s
quotes_baseline   [  33% ] 10 VUs  10.0s/30s

running (0m11.0s), 20/20 VUs, 7209 complete and 0 interrupted iterations
authors_slow      [  37% ] 10 VUs  11.0s/30s
quotes_baseline   [  37% ] 10 VUs  11.0s/30s

running (0m12.0s), 20/20 VUs, 7776 complete and 0 interrupted iterations
authors_slow      [  40% ] 10 VUs  12.0s/30s
quotes_baseline   [  40% ] 10 VUs  12.0s/30s

running (0m13.0s), 20/20 VUs, 8360 complete and 0 interrupted iterations
authors_slow      [  43% ] 10 VUs  13.0s/30s
quotes_baseline   [  43% ] 10 VUs  13.0s/30s

running (0m14.0s), 20/20 VUs, 9052 complete and 0 interrupted iterations
authors_slow      [  47% ] 10 VUs  14.0s/30s
quotes_baseline   [  47% ] 10 VUs  14.0s/30s

running (0m15.0s), 20/20 VUs, 9717 complete and 0 interrupted iterations
authors_slow      [  50% ] 10 VUs  15.0s/30s
quotes_baseline   [  50% ] 10 VUs  15.0s/30s

running (0m16.0s), 20/20 VUs, 10387 complete and 0 interrupted iterations
authors_slow      [  53% ] 10 VUs  16.0s/30s
quotes_baseline   [  53% ] 10 VUs  16.0s/30s

running (0m17.0s), 20/20 VUs, 11036 complete and 0 interrupted iterations
authors_slow      [  57% ] 10 VUs  17.0s/30s
quotes_baseline   [  57% ] 10 VUs  17.0s/30s

running (0m18.0s), 20/20 VUs, 11648 complete and 0 interrupted iterations
authors_slow      [  60% ] 10 VUs  18.0s/30s
quotes_baseline   [  60% ] 10 VUs  18.0s/30s

running (0m19.0s), 20/20 VUs, 12276 complete and 0 interrupted iterations
authors_slow      [  63% ] 10 VUs  19.0s/30s
quotes_baseline   [  63% ] 10 VUs  19.0s/30s

running (0m20.0s), 20/20 VUs, 12971 complete and 0 interrupted iterations
authors_slow      [  67% ] 10 VUs  20.0s/30s
quotes_baseline   [  67% ] 10 VUs  20.0s/30s

running (0m21.0s), 20/20 VUs, 13723 complete and 0 interrupted iterations
authors_slow      [  70% ] 10 VUs  21.0s/30s
quotes_baseline   [  70% ] 10 VUs  21.0s/30s

running (0m22.0s), 20/20 VUs, 14350 complete and 0 interrupted iterations
authors_slow      [  73% ] 10 VUs  22.0s/30s
quotes_baseline   [  73% ] 10 VUs  22.0s/30s

running (0m23.0s), 20/20 VUs, 15133 complete and 0 interrupted iterations
authors_slow      [  77% ] 10 VUs  23.0s/30s
quotes_baseline   [  77% ] 10 VUs  23.0s/30s

running (0m24.0s), 20/20 VUs, 15857 complete and 0 interrupted iterations
authors_slow      [  80% ] 10 VUs  24.0s/30s
quotes_baseline   [  80% ] 10 VUs  24.0s/30s

running (0m25.0s), 20/20 VUs, 16573 complete and 0 interrupted iterations
authors_slow      [  83% ] 10 VUs  25.0s/30s
quotes_baseline   [  83% ] 10 VUs  25.0s/30s

running (0m26.0s), 20/20 VUs, 17345 complete and 0 interrupted iterations
authors_slow      [  87% ] 10 VUs  26.0s/30s
quotes_baseline   [  87% ] 10 VUs  26.0s/30s

running (0m27.0s), 20/20 VUs, 18125 complete and 0 interrupted iterations
authors_slow      [  90% ] 10 VUs  27.0s/30s
quotes_baseline   [  90% ] 10 VUs  27.0s/30s

running (0m28.0s), 20/20 VUs, 18849 complete and 0 interrupted iterations
authors_slow      [  93% ] 10 VUs  28.0s/30s
quotes_baseline   [  93% ] 10 VUs  28.0s/30s

running (0m29.0s), 20/20 VUs, 19570 complete and 0 interrupted iterations
authors_slow      [  97% ] 10 VUs  29.0s/30s
quotes_baseline   [  97% ] 10 VUs  29.0s/30s

running (0m30.0s), 20/20 VUs, 20399 complete and 0 interrupted iterations
authors_slow      [ 100% ] 10 VUs  30.0s/30s
quotes_baseline   [ 100% ] 10 VUs  30.0s/30s

running (0m31.0s), 10/20 VUs, 20412 complete and 0 interrupted iterations
authors_slow    ↓ [ 100% ] 10 VUs  30s
quotes_baseline ✓ [ 100% ] 10 VUs  30s


  █ TOTAL RESULTS 

    checks_total.......: 20422   651.214692/s
    checks_succeeded...: 100.00% 20422 out of 20422
    checks_failed......: 0.00%   0 out of 20422

    ✓ quotes: status is 200
    ✓ authors: status is 200

    HTTP
    http_req_duration................: avg=29.6ms  min=4.01ms med=12.87ms p(90)=20.44ms p(95)=26.18ms p(99)=45.84ms max=4.95s   
      { expected_response:true }.....: avg=29.6ms  min=4.01ms med=12.87ms p(90)=20.44ms p(95)=26.18ms p(99)=45.84ms max=4.95s   
      { scenario:authors_slow }......: avg=3.12s   min=1.49s  med=3.07s   p(90)=3.54s   p(95)=4.91s   p(99)=4.95s   max=4.95s   
      { scenario:quotes_baseline }...: avg=14.37ms min=4.01ms med=12.86ms p(90)=20.22ms p(95)=25.21ms p(99)=38.79ms max=362.78ms
    http_req_failed..................: 0.00%  0 out of 20422
    http_reqs........................: 20422  651.214692/s

    EXECUTION
    iteration_duration...............: avg=29.95ms min=4.33ms med=13.21ms p(90)=20.96ms p(95)=26.6ms  p(99)=46.42ms max=4.96s   
    iterations.......................: 20422  651.214692/s
    vus..............................: 10     min=10         max=20
    vus_max..........................: 20     min=20         max=20

    NETWORK
    data_received....................: 50 MB  1.6 MB/s
    data_sent........................: 1.9 MB 62 kB/s



running (0m31.4s), 00/20 VUs, 20422 complete and 0 interrupted iterations
authors_slow    ✓ [ 100% ] 10 VUs  30s
quotes_baseline ✓ [ 100% ] 10 VUs  30s